
const d = new Date();
const day = d.getDate();
const month = d.getMonth()+1;


const p2702 = "ראויה השבת בארץ ישראל - מכל הבחינות - לכתרה משלה... ואנו מאמינים, כי שבת הקדומים כוחה עמה לפרוש עלינו סוכת אחדות ושלום, עוד כוחה עמה לחדש עלינו את קדושתה ולהחזיר לנו את מנוחתה."
const p2802 = "ראויה השבת בארץ ישראל - מכל הבחינות - לכתרה משלה... ואנו מאמינים, כי שבת הקדומים כוחה עמה לפרוש עלינו סוכת אחדות ושלום, עוד כוחה עמה לחדש עלינו את קדושתה ולהחזיר לנו את מנוחתה."




let phrase;
    if (day === 27 & month === 2) { phrase = p2702 }
    if (day === 28 & month === 2) { phrase = p2802 }
    else { phrase = p2702 };









const Quote = () => {
    return (
        phrase
    );
}


export default Quote;