import './about.css'


const About = () => {
    return (
        <div id="about">
            אוסף מאמרים וסיפורים שנכתבו על ידי הסופר שרגא קדרי והודפסו ברובם בעיתונות העברית.
            חלק מן המאמרים והסיפורים נסרקו על ידי הספרייה הלאומית וחלקם על ידי בני המשפחה.
            באוסף כחמש מאות פרסומים. האוסף חולק לשתי קטגוריות עיקריות: מאמרים וסיפורים.
            תחת כל מאמר מופיעות מילות מפתח על מנת להקל את החיפוש (כתיבת מילות המפתח עדיין בשלבי הכנה).
            ניתן לאתר על ידי שורת החיפוש בכמה אפשרויות: <br/>
            א. שם המאמר או הסיפור <br/>
            ב. לפי הקטגוריות השונות <br/>
            ג. מילות המפתח <br/>
            ד. שם העיתון של הפרסום <br/>
            ה. שנת הפרסום <br/>
            ו. תאריך מלא של הפרסום <br/>
            האתר עדיין נמצא בתהליך בנייה וקרוב לודאי שיחולו בו שינויים, תוספות ושיפורים במהלך השנה הקרובה.
            העוסקים במלאכה:
            יהודה ורועי קדרי
        </div>
    )
};
  
export default About;