import "./biography.css";
import gly from "./גלויה.jpg";
import btcnst from "./ביכ.jpg";
import itn from "./עיתון.jpg";
import oz from "./עוז.jpg"

const Biography = () => {
    return ( 
    <div>
    <p className="bioTitle">קורות חיים</p>
        <div id="biography">
        <p id="abs">
            שרגא קדרי נולד בכ' בטבת תרס"ז, 06.01.1907
            בזנישני (znesinnia), פרוור של העיר לבוב שבגליציה (כיום אוקראינה).
            בילדותו כינו אותו פייבלה טפר, והוא היה בן הזקונים למשפחה בת שבע נפשות.
            אביו, דב עקיבא
            (בערל)
            היה חזן בבית הכנסת בזנישני וחזן של הרבי מהוסיאטין.
            בנוסף היה עסקן של "חובבי ציון".
            אמו, שושנה
            (רוזא צוועטא),
            הייתה בתו של נחמיה בער, שהיה סופר סת"ם של הרבי מהוסיאטין.
        <br/><br/>
            שרגא קיבל חינוך מסורתי ב"חדר", בישיבה ובגימנסיה.
            באותן שנים החלו צעירים יהודים ברחבי העולם להתארגן לקראת עלייה לארץ ישראל. 
            שרגא השתייך לתנועת הנוער "החלוץ המזרחי" ולקבוצת ההכשרה "מחרשה", ועבד בכפר אוקנו 
            (vikno)
            שבמחוז טרנופול. לפי ידידו, דב סדן:
            "מה שהעסיק את שיחותינו בלבוב היו עניני "החלוץ", וזיקת הסקטור הדתי אליו".
            בשנת 1926 שרגא עלה ארצה בעקבות אחיו ברוך, שעלה לארץ שנתיים קודם לכן.
        </p>
        <p id="abs2">
            בארץ שרגא עבד בפרדסים ובכרמים בפתח תקווה, בסלילת כבישים וחפירת בארות.
            במקביל נעורה בו אש הכתיבה, והוא החל לכתוב סיפורים ורשימות בעיתונים
            "ההד", "העברי" ו"כתובים".
            בתחילה שרגא התיידד עם ברל כצנלסון וסופרים אחרים בני תנועת העבודה,
            אך בהמשך חייו הוא התקרב לגופים דתיים לאומיים.
            יצירתו פורסמה במרבית העיתונים וכתבי העת בארץ, הן של תנועת העבודה
            ("הפועל הצעיר", "דבר")
            והן של המזרחי והמפד"ל
            ("הצופה", "ההד"). <br/><br/>
            בשנת 1934 שרגא נשא לאישה את ימימה סילמן, בתו של המשורר קדיש יהודה סילמן.
            הם היו פעילים בתנועת הפועל המזרחי וממייסדי כפר פינס.
            קבוצת ההכשרה של כפר פינס שהתה בכרכור לפני העלייה לקרקע.
            בכרכור באותה תקופה פשתה מחלת הקדחת, וימימה, שכבר נשאה תינוק ברחמה, נדבקה במחלה.
            הרופאים תבעו ממנה לעזוב את כרכור ושרגא וימימה עברו לירושלים.
        </p>
        
        <div id="imgnsub">
            <img src={btcnst} alt="" id="btcnst" />
            <span id="subtext">
            בית הכנסת בזנישני. מצד שמאל - הדירה של משפחת טפר
            </span>
        </div>

        <div id="imgnsub2">
            <img src={gly} alt="" id="gly" />
            <span id="subtext">
                ברוך ושרגא קדרי, גלויה מארץ ישראל, 1928
            </span>   
        </div>

        <div id="imgnsub3">
            <img src={itn} alt="" id="itn" />
            <span id="subtext">
            מתוך העיתון דבר, 30.06.1933
            </span>
        </div>

        <div id="imgnsubLast">
            <img src={oz} alt="" id="oz" />
            <span id="subtext">
            עמוס עוז, סיפור על אהבה וחושך, עמ' 464
            </span><br/><br/>
        </div>

        </div>
    </div>
    )
};
  
export default Biography;