import "./biography.css";
import gly from "./גלויה.jpg";
import btcnst from "./ביכ.jpg";

const Biography = () => {
    return ( 
    <div>
    <p className="bioTitle">קורות חיים</p>
        <div id="biography">
        <p id="abs">
            שרגא קדרי נולד בכ' בטבת תרס"ז, 06.01.1907
            בזנישני (znesinnia), פרוור של העיר לבוב שבגליציה (כיום אוקראינה).
            בילדותו כינו אותו פייבלה טפר, והוא היה בן הזקונים למשפחה בת שבע נפשות.
            אביו, דב עקיבא
            (בערל)
            היה חזן בבית הכנסת בזנישני וחזן של הרבי מהוסיאטין.
            בנוסף היה עסקן של "חובבי ציון".
            אמו, שושנה
            (רוזא צוועטא),
            הייתה בתו של נחמיה בער, שהיה סופר סת"ם של הרבי מהוסיאטין.
        <br/><br/>
            שרגא קיבל חינוך מסורתי ב"חדר", בישיבה ובגימנסיה.
            באותן שנים החלו צעירים יהודים ברחבי העולם להתארגן לקראת עלייה לארץ ישראל. 
            שרגא השתייך לקבוצת ההכשרה "מחרשה", ועבד בכפר אוקנו 
            (vikno)
            שבמחוז טרנופול. לפי ידידו, דב סדן:
            "מה שהעסיק את שיחותינו בלבוב היו עניני "החלוץ", וזיקת הסקטור הדתי אליו".
            בשנת 1926 שרגא עלה ארצה בעקבות אחיו ברוך, שעלה לארץ שנתיים קודם לכן.

        </p>
        
        <div id="imgnsub">
            <img src={btcnst} alt="" id="btcnst" />
            <span id="subtext">
            בית הכנסת בזנישני. מצד שמאל - הדירה של משפחת טפר
            </span>
        </div>

        <div id="imgnsub2">
            <img src={gly} alt="" id="gly" />
            <span id="subtext">
                ברוך ושרגא קדרי, גלויה מארץ ישראל, 1928
            </span>   
        </div>
        </div>
    </div>
    )
};
  
export default Biography;