import "./biography.css";
import gly from "./גלויה.jpg";
import btcnst from "./ביכ.jpg";
import itn from "./עיתון.jpg";
import oz from "./עוז.jpg"

const Biography = () => {
    return ( 
    <div>
    <p className="bioTitle">קורות חיים</p>
        <div id="biography">
        <p id="abs">
            שרגא קדרי נולד בכ' בטבת תרס"ז, 06.01.1907
            בזנישני (znesinnia), פרוור של העיר לבוב שבגליציה (כיום אוקראינה).
            בילדותו כינו אותו פייבלה טפר, והוא היה בן הזקונים למשפחה בת שבע נפשות.
            אביו, דב עקיבא
            (בערל)
            היה חזן בבית הכנסת בזנישני וחזן של הרבי מהוסיאטין.
            בנוסף היה עסקן של "חובבי ציון".
            אמו, שושנה
            (רוזא צוועטא),
            הייתה בתו של נחמיה בער, שהיה סופר סת"ם של הרבי מהוסיאטין.
        <br/><br/>
            שרגא קיבל חינוך מסורתי ב"חדר", בישיבה ובגימנסיה.
            באותן שנים החלו צעירים יהודים ברחבי העולם להתארגן לקראת עלייה לארץ ישראל. 
            שרגא השתייך לתנועת הנוער "החלוץ המזרחי" ולקבוצת ההכשרה "מחרשה", ועבד בכפר אוקנו 
            (vikno)
            שבמחוז טרנופול. לפי ידידו, דב סדן:
            "מה שהעסיק את שיחותינו בלבוב היו עניני "החלוץ", וזיקת הסקטור הדתי אליו".
            בשנת 1926 שרגא עלה ארצה בעקבות אחיו ברוך, שעלה לארץ שנתיים קודם לכן.
        </p>
        <p id="abs2">
            בארץ שרגא עבד בפרדסים ובכרמים בפתח תקווה, בסלילת כבישים וחפירת בארות.
            במקביל נעורה בו אש הכתיבה, והוא החל לכתוב סיפורים ורשימות בעיתונים
            "ההד", "העברי" ו"כתובים".
            בתחילה שרגא התיידד עם ברל כצנלסון וסופרים אחרים בני תנועת העבודה,
            אך בהמשך חייו הוא התקרב לגופים דתיים לאומיים.
            יצירתו פורסמה במרבית העיתונים וכתבי העת בארץ, הן של תנועת העבודה
            ("הפועל הצעיר", "דבר")
            והן של המזרחי והמפד"ל
            ("הצופה", "ההד"). <br/><br/>
            בשנת 1934 שרגא נשא לאישה את ימימה סילמן, בתו של המשורר קדיש יהודה סילמן.
            הוא היה פעיל בתנועת הפועל המזרחי וממייסדי כפר פינס.
            קבוצת ההכשרה של כפר פינס שהתה בכרכור לפני העלייה לקרקע.
            בכרכור באותה תקופה פשתה מחלת הקדחת, וימימה, שכבר נשאה תינוק ברחמה, נדבקה במחלה.
            הרופאים תבעו ממנה לעזוב את כרכור ושרגא וימימה עברו לירושלים.
        </p>
        <p id="abs3">
        שרגא התמחה בענייני נוער עבריין ונשא בשורה של תפקידים בכירים בתחום זה.
        בין השאר היה המזכיר הכללי של משרד הסעד לאחר הקמת המדינה, חבר בוועדה הקרואה שניהלה את ירושלים ועוד.
        נוסף לכתיבת הסיפורת שלו, סיפורים קצרים נובלות ורומנים, פרסם גם מאמרי פובליציסטיקה.
        בעיקר בשנותיו האחרונות, כאשר תמך בתנועת ארץ ישראל השלמה. 
        שרגא היה גם עורך, וערך כמה ממאספי ירושלים.
        על עבודתו הספרותית זכה בשנת 1964 ב"פרס שפירא" לספרות, מיסודה של המפד"ל.
        <br/><br/>
        מספריו:
        <ul>
            <li>ממרתף העולם, סיפורים, הוצאת דבר, תל אביב 1936.</li>
            <li>אסונה של עלינה, רומן, הוצאת ארץ ישראל, תל אביב 1939.</li>
            <li>עיניים עצומות, סיפור, עם עובד, תש"ה 1945. </li>
            <li>הבהוב בשקיעה, תרצ'ט 1939.</li>
            <li>מי יתן בוקר, סיפור, עם עובד, תש"ך 1960.</li>
            <li>מגילת כורך ספרים, סיפור, קריית ספר, ירושלים, 1962.</li>
            <li>שזופי הלחי האחת, סיפורים, אגודת הסופרים ליד הוצאת מסדה, 1967.</li>
            <li>פרופסור אלקנה ורמי בנו, סיפור, אגודת שלם ירושלים תשל'א 1971.</li>
            <li>וצאן ידו, סיפורים תרצ"ו - תשל"ו, הביא לדפוס דוד טלזנר, עציון ירושלים, 1977.</li>
            <li>והבוקר לדרכו עולה, רומן, יחדיו תל אביב 1981.</li>
        </ul>
        </p>
        <p  id="abs4">
            ילדיו: <br/>
            דור (שנת פטירה: תשפ"א 2020)<br/>
            קדיה (לשונאית),
            יהודה (מוסיקאי),
            עקיבא (מתמטיקאי).
        </p>

        
        <div id="imgnsub">
            <img src={btcnst} alt="" id="btcnst" />
            <span id="subtext">
            בית הכנסת בזנישני. מצד שמאל - הדירה של משפחת טפר
            </span>
        </div>

        <div id="imgnsub2">
            <img src={gly} alt="" id="gly" />
            <span id="subtext">
                ברוך ושרגא קדרי, גלויה מארץ ישראל, 1928
            </span>   
        </div>

        <div id="imgnsub3">
            <img src={itn} alt="" id="itn" />
            <span id="subtext">
            מתוך העיתון דבר, 30.06.1933
            </span>
        </div>

        <div id="imgnsubLast">
            <img src={oz} alt="" id="oz" />
            <span id="subtext">
            עמוס עוז, סיפור על אהבה וחושך, עמ' 464
            </span><br/><br/>
        </div>

        </div>
    </div>
    )
};
  
export default Biography;